{
    "rubric_items": [
      {
        "title": "R/Python cited",
        "range": {
          "min": 0,
          "max": 1
        },
        "values": {
          "0": "No",
          "1": "Yes"
        },
        "criteria": "R (and/or Python) is properly referenced in the main content and in the reference list. If not, then paper gets 0 overall.",
        "critical": true
      },
      {
        "title": "Data cited",
        "range": {
          "min": 0,
          "max": 1
        },
        "values": {
          "0": "No",
          "1": "Yes"
        },
        "criteria": "Data are properly referenced in the main content and in the reference list. If not, then paper gets 0 overall.",
        "critical": true
      },
      {
        "title": "Class paper",
        "range": {
          "min": 0,
          "max": 1
        },
        "values": {
          "0": "No",
          "1": "Yes"
        },
        "criteria": "There should be no sign this is a class project. Check the rproj and folder names, the README, the title, code comments, etc. If there is any sign this is a class paper, then paper gets 0 overall.",
        "critical": true
      },
      {
        "title": "LLM usage documented",
        "range": {
          "min": 0,
          "max": 1
        },
        "values": {
          "0": "No",
          "1": "Yes"
        },
        "criteria": "A separate paragraph or dot point must be included in the README about whether LLMs were used, and if so how. If auto-complete tools such as co-pilot were used this must be mentioned. If chat tools such as Chat-GPT, were used then the entire chat must be included in the usage text file. If not, then paper gets 0 overall.",
        "critical": true
      },
      {
        "title": "Title",
        "range": {
          "min": 0,
          "max": 2
        },
        "values": {
          "0": "Poor or not done",
          "1": "Yes",
          "2": "Exceptional"
        },
        "criteria": "An informative title is included that explains the story, and ideally tells the reader what happens at the end of it. 'Paper X' is not an informative title. Use a subtitle to convey the main finding. Do not use puns (you can break this rule once you're experienced). There should be no evidence this is a school paper."
      },
      {
        "title": "Author, date, and repo",
        "range": {
          "min": 0,
          "max": 2
        },
        "values": {
          "0": "Poor or not done",
          "2": "Yes"
        },
        "criteria": "The author, date of submission in unambiguous format, and a link to a GitHub repo are clearly included. (The later likely, but not necessarily, through a statement such as: 'Code and data supporting this analysis is available at: LINK')."
      },
      {
        "title": "Abstract",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "1": "Some issues",
          "2": "Acceptable",
          "3": "Exceeds expectations",
        "4": "Exceptional"
      },
      "criteria": "An abstract is included and appropriately pitched to a non-specialist audience. The abstract answers: 1) what was done, 2) what was found, and 3) why this matters (all at a high level). Likely four sentences. Abstract must make clear what we learn about the world because of this paper."
    },
    {
      "title": "Introduction",
      "range": {
        "min": 0,
        "max": 4
      },
      "values": {
        "0": "Poor or not done",
        "1": "Some issues",
        "2": "Acceptable",
        "3": "Exceeds expectations",
        "4": "Exceptional"
      },
      "criteria": "The introduction is self-contained and tells a reader everything they need to know including: 1) broader context to motivate; 2) some detail about what the paper is about; 3) a clear gap that needs to be filled; 4) what was done; 5) what was found; 6) why it is important; 7) the structure of the paper. A reader should be able to read only the introduction and know what was done, why, and what was found. Likely 3 or 4 paragraphs, or 10 per cent of total."
    },
    {
      "title": "Estimand",
      "range": {
        "min": 0,
        "max": 1
      },
      "values": {
        "0": "Poor or not done",
        "1": "Done"
      },
      "criteria": "The estimand is clearly stated in the introduction."
    },
    {
        "title": "Data",
        "range": {
          "min": 0,
          "max": 10
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Some issues",
          "6": "Acceptable",
          "8": "Exceeds expectations",
          "10": "Exceptional"
        },
        "criteria": "A sense of the dataset should be communicated to the reader. The broader context of the dataset should be discussed. All variables should be thoroughly examined and explained. Explain if there were similar datasets that could have been used and why they were not. If variables were constructed then this should be mentioned, and high-level cleaning aspects of note should be mentioned, but this section should focus on the destination, not the journey. It is important to understand what the variables look like by including graphs, and possibly tables, of all observations, along with discussion of those graphs and the other features of these data. Summary statistics should also be included, as well as any relationships between the variables. If this becomes too detailed, then appendices could be used. Basically, for every variable in your dataset that is of interest to your paper, there needs to be graphs and explanation and maybe tables.",
        "critical": false
      },
      {
        "title": "Measurement",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "2": "Some issues",
          "3": "Acceptable",
          "4": "Exceptional"
        },
        "criteria": "A thorough discussion of measurement, relating to the dataset, is provided in the data section. Please ensure that you explain how we went from some phenomena in the world that happened to an entry in the dataset that you are interested in.",
        "critical": false
      },
      {
        "title": "Model",
        "range": {
          "min": 0,
          "max": 10
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Some issues",
          "6": "Acceptable",
          "8": "Exceeds expectations",
          "10": "Exceptional"
        },
        "criteria": "Present the model clearly using appropriate mathematical notation and plain English explanations, defining every component. Ensure the model is well-explained, justified, appropriate, and balanced in complexity—neither overly simplistic nor unnecessarily complicated—for the situation. Variables should be well-defined and correspond with those in the data section. Explain how modeling decisions reflect aspects discussed in the data section, including why specific features are included. If applicable, define and justify sensible priors for Bayesian models. Clearly discuss underlying assumptions, potential limitations, and situations where the model may not be appropriate. Mention the software used to implement the model, and provide evidence of model validation and checking—such as out-of-sample testing, RMSE calculations, test/training splits, or sensitivity analyses—addressing model convergence and diagnostics.",
        "critical": false
      },
      {
        "title": "Results",
        "range": {
          "min": 0,
          "max": 10
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Some issues",
          "6": "Acceptable",
          "8": "Exceeds expectations",
          "10": "Exceptional"
        },
        "criteria": "Results will likely require summary statistics, tables, graphs, images, and possibly statistical analysis or maps. There should also be text associated with all these aspects. Show the reader the results by plotting them where possible. Talk about them. Explain them. This section should strictly relay results.",
        "critical": false
      },
      {
        "title": "Discussion",
        "range": {
          "min": 0,
          "max": 10
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Some issues",
          "6": "Acceptable",
          "8": "Exceeds expectations",
          "10": "Exceptional"
        },
        "criteria": "The discussion should include subsections addressing: What is done in this paper? What is learned about the world? What are some weaknesses of what was done? What is left to learn or how should we proceed in the future?",
        "critical": false
      },
      {
        "title": "Prose",
        "range": {
          "min": 0,
          "max": 6
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Acceptable",
          "6": "Exceptional"
        },
        "criteria": "All aspects should be free of noticeable typos, spelling mistakes, and be grammatically correct. Prose should be coherent, concise, clear, and mature. Avoid redundant words and specific phrases like 'advanced,' 'data-driven,' etc.",
        "critical": false
      },
      {
        "title": "Cross-references",
        "range": {
          "min": 0,
          "max": 1
        },
        "values": {
          "0": "Poor or not done",
          "1": "Yes"
        },
        "criteria": "All figures, tables, and equations should be numbered and referred to in the text using cross-references.",
        "critical": false
      },
      {
        "title": "Captions",
        "range": {
          "min": 0,
          "max": 2
        },
        "values": {
          "0": "Poor or not done",
          "1": "Acceptable",
          "2": "Excellent"
        },
        "criteria": "All figures and tables have detailed and meaningful captions.",
        "critical": false
      },
      {
        "title": "Graphs and tables",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "1": "Some issues",
          "2": "Acceptable",
          "3": "Exceeds expectations",
          "4": "Exceptional"
        },
        "criteria": "Graphs and tables must be well-formatted, clear, and serve a clear purpose; they should be fully self-contained, appropriately sized and colored, and have appropriate significant figures.",
        "critical": false
      },
      {
        "title": "Idealized methodology",
        "range": {
          "min": 0,
          "max": 10
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Some issues",
          "6": "Acceptable",
          "8": "Exceeds expectations",
          "10": "Exceptional"
        },
        "criteria": "The proposed methodology is well-thought-through, realistic, and would achieve the goals of the study.",
        "critical": false
      },
      {
        "title": "Idealized survey",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "1": "Some issues",
          "2": "Acceptable",
          "3": "Exceeds expectations",
          "4": "Exceptional"
        },
        "criteria": "The survey includes an introductory section, well-constructed questions in an appropriate order, and a thank you section for respondents.",
        "critical": false
      },
      {
        "title": "Pollster methodology overview and evaluation",
        "range": {
          "min": 0,
          "max": 10
        },
        "values": {
          "0": "Poor or not done",
          "2": "Many issues",
          "4": "Some issues",
          "6": "Acceptable",
          "8": "Exceeds expectations",
          "10": "Exceptional"
        },
        "criteria": "Provide a thorough overview and evaluation of the pollster’s methodology, highlighting strengths and limitations.",
        "critical": false
      },
      {
        "title": "Referencing",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "3": "One minor issue",
          "4": "Perfect"
        },
        "criteria": "All data, software, literature, and other relevant materials should be cited in-text and included in a properly formatted reference list.",
        "critical": false
      },
      {
        "title": "Commits",
        "range": {
          "min": 0,
          "max": 2
        },
        "values": {
          "0": "Poor or not done",
          "2": "Excellent"
        },
        "criteria": "There are at least a handful of different commits, with meaningful commit messages.",
        "critical": false
      },
      {
        "title": "Sketches",
        "range": {
          "min": 0,
          "max": 2
        },
        "values": {
          "0": "Poor or not done",
          "2": "Exceptional"
        },
        "criteria": "Sketches are included in a labeled folder in the repo, are appropriate, and of high-quality.",
        "critical": false
      },
      {
        "title": "Simulation",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "1": "Some issues",
          "2": "Acceptable",
          "3": "Exceeds expectations",
          "4": "Exceptional"
        },
        "criteria": "The script is clearly commented and structured. All variables are appropriately simulated in a sophisticated way.",
        "critical": false
      },
      {
        "title": "Tests-simulation",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "2": "Acceptable",
          "3": "Exceeds expectations",
          "4": "Exceptional"
        },
        "criteria": "High-quality tests are written for the simulated dataset, and in their own script.",
        "critical": false
      },
      {
        "title": "Tests-actual",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "2": "Acceptable",
          "3": "Exceeds expectations",
          "4": "Exceptional"
        },
        "criteria": "High-quality tests are written for the dataset, and in their own script.",
        "critical": false
      },
      {
        "title": "Parquet",
        "range": {
          "min": 0,
          "max": 1
        },
        "values": {
          "0": "No",
          "1": "Yes"
        },
        "criteria": "The analysis dataset is saved as a parquet file. (Note that the raw data should be saved in whatever format it came in.)",
        "critical": false
      },
      {
        "title": "Reproducible workflow",
        "range": {
          "min": 0,
          "max": 4
        },
        "values": {
          "0": "Poor or not done",
          "1": "Some issues",
          "2": "Acceptable",
          "3": "Exceeds expectations",
          "4": "Exceptional"
        },
        "criteria": "Use an organized repo with a detailed README and an R project. Document code thoroughly, exclude unnecessary files from the repo, and avoid hard-coded paths.",
        "critical": false
      },
      {
        "title": "Miscellaneous",
        "range": {
          "min": 0,
          "max": 3
        },
        "values": {
          "0": "None",
          "1": "Notable",
          "2": "Remarkable",
          "3": "Exceptional"
        },
        "criteria": "This item accounts for exceptional aspects not covered by the rubric.",
        "critical": false
      }
    ]
  }
  